
//'number' + 3 + 3. Перше значення String, далі 2 значення numbers. У данному випадку конкатенація, тобто склеювання даних
// result: number33
//var result = 'number'+3+3;
//console.log(result);

//null + 3. Якщо до нічого додати 3, буде 3
// result: 3
//var result = null+3;
//console.log(result);

//5 && "qwerty". Тут використовується логічний оператор "і". Ліва частина, число ненульове, значить, true, у правій
// частині string 'qwerty' також не пустий. Тоді повернеться ¨qwerty¨ як останній істинний операнда
//var result = 5&&'qwerty';
//console.log(result);

//+'40' + +'2' + "hillel"; +'40'  це унарний +, приводить до числа 40, +"2" це також унарний +, приводить до числа 2
// плюс між ними - арифметична дія складання, отримуємо 42, далі конкатенація 42+"hillel", відповідь 42hillel
//var result = +'40' + +'2' + "hillel";
//console.log(result);

//'10' - 5 === 6; Тут маємо результат порівняння, ліва частина дорівнює 5, права 6, тобто результат false
//var result = '10' - 5 === 6;
//console.log(result);

//true + false. true це 1, false це 0, після додавання 1+0 отримуємо 1
//var result = true + false
//console.log(result);


//'4px' - 3. отримуємо Nan, тому щовід String намагаємось відняти число
//var result = '4px' - 3
//console.log(result);

//'4' - 3. 4 стає числом 4, результат віднімання 4-3=1
//var result = '4' - 3
//console.log(result);



//'6' + 3 ** 0; Результат 61, 3 ** 0 дорівнює 1, '6' це String, 1 число, є оператор +, тут виконується операція
// об´єднання
//var result ='6' + 3 ** 0;
//console.log(result);

//12 / '6'. Виконується операція ділення, 12 це число, 6 це стрінга, яка перетворюється у число, результат операціі 2
//var result =12 / '6'
//console.log(result);

//'10' + (5 === 6);. У дужках у нас операція порівняння, яка дає false, далі у нас є стрінга 10 та false, також
// оператор +, вийшло склеювання, результат 10false
//var result ='10' + (5 === 6);
//console.log(result);


//null == ''. Порівняння null з пустою стрінгою, результат false
//var result =null == ''
//console.log(result);

//3 ** (9 / 3); Тут виконуються математичні діі, спочатку ділення у дужках, дає 3. потім 3 треба возвести у ступінь 3, результат 27
//var result =3 ** (9 / 3);
//console.log(result);

//!!'false' == !!'true'. ! використовується двічі для перетворення рядка 'false' на логічне значення. Перше ! перетворює
// його на false, а друге ! знову на true. Таким чином, результат цього виразу буде true.!!'true' також перетворюється
// спочатку на false, потім на true. І результат порівняння true
//var result =!!'false' == !!'true'
//console.log(result);

//0 || '0' && 1.  0 це false в логічних операціях, '0' це рядок і є true 1 також є true.
//Оператор || (логічне "або") повертає перший операнд, якщо він "істинний", інакше повертає другий операнд.
// у нашому випадку '0'.Залишилася операція && (логічне "і"). Вираз '0' && 1 порівнює '0' (true) і 1 (true). Повертає другий
// операнд, тобто 1
//var result =0 || '0' && 1
//console.log(result);

//(+null == false) < 1; +null - + унарний оператор конвертує null у число. Результатом буде 0, далі буде
// порівняння  0 == 0, і воно true, далі порівнюємо 1<1 і це false
//var result =(+null == false) < 1;
//console.log(result);

//false && true || true. false && true - це вираз з логічним оператором && (логічне "і"), результат false,
// далі логічний оператор або, false || true, повертає true, якщо хоч один є true, тобто, результат true
//var result =false && true || true
//console.log(result);


//false && (false || true); false || true - це вираз з логічним оператором || (логічне "або"). Цей оператор
// повертає true, якщо хоча б один з операндів є true, тобто, поверне true.
//вираз false && true, використовується логічний оператор && (логічне "і"). Цей оператор повертає false, якщо
// хоча б один з операндів є false, Результат є false
//var result =false && (false || true);
//console.log(result);

//(+null == false) < 1 ** 5; +null - + унарний оператор, перетворює нулл у число 0,
//порівняння у лівій частині буде 0 == 0, і воно true. 1 ** 5 - це вираз піднесення числа 1 до степеня 5,
// залишається числом 1. Тепер ми маємо вираз true < 1, що є false
//var result =(+null == false) < 1 ** 5;
//console.log(result);














